app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "first_name", "last_name", "birthdate", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "profiles" ("owner_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["owner_id", 3], ["created_at", "2020-04-29 17:31:30.045532"], ["updated_at", "2020-04-29 17:31:30.045532"]]
---
    def create
        @user = User.new(user_params)

        if @user.save
            @profile = Profile.create({owner_id: @user.id})